# В то далёкое время, когда Паша ходил в школу, ему очень не нравилась формула 
# Герона для вычисления площади треугольника, так как казалась слишком сложной. 
# В один прекрасный момент Павел решил избавить всех школьников от страданий и
#  написать и распространить по школам программу, вычисляющую площадь треугольника
#   по трём сторонам.

# Одна проблема: так как эта формула не нравилась Павлу, он её не запомнил.
#  Помогите ему завершить доброе дело и напишите программу, вычисляющую площадь
#   треугольника по переданным длинам трёх его сторон по формуле Герона:

# S=√p(p−a)(p−b)(p−c)
# где p=((a+b+c)/2) – полупериметр треугольника. На вход программе подаются целые числа,
#  выводом программы должно являться вещественное число, соответствующее площади 
#  треугольника.

# Sample Input:

# 3
# 4
# 5
# Sample Output:

# 6.0


a = int(input())
b = int(input())
c = int(input())

p = (a + b + c) / 2
S = (p*((p-a)*(p-b)*(p-c)))  

import math
print (math.sqrt(S))         


#
# a, b, c = [int(input()) for i in range(3)]
# p = ((a + b + c)/2)
# S = ((p*(p-a)*(p-b)*(p-c))**0.5)
# print(S)

#
# a = int(input())
# b = int(input())
# c = int(input())
# p = ((a+b+c)/2)
# s = ((p*(p-a)*(p-b)*(p-c))**0.5)
# print(s)


#
# a,b,c=int(input()),int(input()),int(input())
# print((((a+b+c)/2)*((b+c-a)/2)*((a-b+c)/2)*((a+b-c)/2))**0.5)


#
# a, b, c = [int(input()) for i in range(3)]
# p = ((a + b + c)/2)
# print((p*(p-a)*(p-b)*(p-c))**0.5)


# MastHew!!!!
# exec("exec(\"print((((a+b+c)*(-a+b+c)*(a-b+c)*(a+b-c))**0.5)/4)\", {C:int(input()) for C in ('a','b','c')})")



#
# a,b,c=map(int, open(0))
# print(((a+b+c)*(b+c-a)*(a+c-b)*(a+b-c))**0.5/4)



#
# a = int(input())
# b = int(input())
# c = int(input())

# p = (a + b + c) / 2

# s = (p * (p - a) * (p - b) * (p - c)) ** 0.5
# print(s)