# Напишите программу, которая считывает с клавиатуры два числа a и b, считает и 
# выводит на консоль среднее арифметическое всех чисел из отрезка [a;b], которые 
# делятся на 3.

# В приведенном ниже примере среднее арифметическое считается для чисел на отрезке 
# [−5;12]. Всего чисел, делящихся на 3, на этом отрезке 6: −3,0,3,6,9,12. Их среднее
#  арифметическое равно 4.5

# На вход программе подаются интервалы, внутри которых всегда есть хотя бы одно число,
#  которое делится на 3.﻿



a,b = int(input()), int(input())
a += -a%3
b -= b%3
print((a+b)/2)



#
# a,b = (int(input()) for i in (1, 2)) 
# print(((a+(3-a%3)%3)+b-(b%3))/2)



#
# a=int(input(''))
# b=int(input(''))
# numbers = [x for x in range(a, b+1) if x%3 == 0]
# print(sum(numbers)/float((len(numbers))))




# 
# a, b = int(input()), int(input())

# sm = 0;
# n = 0;
# for i in range(a, b + 1):
#     if i % 3 == 0:
#         sm += i
#         n += 1
# print(sm / n)



#
# a, b = (int(input()) for _ in range(2))
# print(((a+(3-a%3)%3)+b-(b%3))/2)