
# GC-состав является важной характеристикой геномных последовательностей и 
# определяется как процентное соотношение суммы всех гуанинов и цитозинов к 
# общему числу нуклеиновых оснований в геномной последовательности. 

# Напишите программу, которая вычисляет процентное содержание символов 
# G (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть 
# 	от регистра вводимых символов).

# Например, в строке "acggtgttat" процентное содержание символов G и C 
# равно 410⋅100=40.0, где 4 -- это количество символов G и C,  а 10 -- это 
# длина строки.

# Sample Input:

# acggtgttat
# Sample Output:

# 40.0


genome = input().upper()
x = genome.count('C')
y = genome.count('G')
z = genome.count('')-1
s = ((x+y)/(z))*100
print(s)


#
# genome = input().upper()
# x = genome.count('C')
# y = genome.count('G')
# z = len(genome)
# s = ((x+y)/(z))*100
# print(s)





#
# s = input().upper()
# print((s.count('G') + s.count('C'))/len(s) * 100)



#
# s = input()
# c = 0
# for ch in s:
#     if ("gcGC".find(ch) != -1):
#         c += 1
# print(c / len(s) * 100)